app/Controllers/Pqr.php

INSERT INTO `pqr` (`DETALLE`, `ESTADO_ID`, `USUARIO_ID`, `PQR_TIPO`) VALUES ('JHGSJGHDJDGHJSD', 'pendiente', '199', '1')
---
    public function create()
    {
        $pqrModel = new PqrModel();

        $data = [
            'DETALLE' => $this->request->getPost('DETALLE'),
            'ESTADO_ID' => $this->request->getPost('ESTADO_ID'),
            'USUARIO_ID' => $this->request->getPost('USUARIO_ID'),
            'PQR_TIPO' => $this->request->getPost('PQR_TIPO'),
        ];

        if ($pqrModel->insert($data)) {