app/Controllers/User.php

    public function update($id)
{
    $userModel = new UserModel();

    // Obtener el usuario actual
    $users = $userModel->find($id);

    // Verificar si el usuario existe
    if ($users) {
        // Obtener los datos del formulario
        $data = [
            'email' => $this->request->getVar('email') ?? $users['email'],
            'password' => $this->request->getVar('password') ? password_hash($this->request->getVar('password'), PASSWORD_DEFAULT) : $users['password'],
        ];

        // Actualizar el usuario en la base de datos
        if ($userModel->update($id, $data)) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
UPDATE `users` SET `email` = 'juan2@gmail.com', `password` = '$2y$10$z/Rc6XZM4Gsx8qzvkyqA0OqX4XhfCDf7JGa0uTwMMYMKm8kc7AGVq', `updated_at` = '2024-06-23 06:09:54'
WHERE `users`.`id` IN ('3')

public function delete($id)
{
    $userModel = new UserModel();

    // Obtener el usuario actual
    $users = $userModel->find($id);

    // Verificar si el usuario existe
    if ($users) {
        // Eliminar el usuario de la base de datos
        if ($userModel->delete($id)) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'
DELETE FROM `users`
WHERE `id` IN ('7')